tap "auth0/auth0-cli"
tap "bufbuild/buf"
tap "figuretechnologies/figure"
tap "goreleaser/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jakewharton/repo"
tap "jdxcode/tap"
tap "tufin/tufin"
tap "txn2/tap"
tap "warrensbox/tap"
tap "withgraphite/tap"
brew "act"
brew "bash"
brew "bat"
brew "bottom"
brew "buf"
brew "node"
brew "cdktf"
brew "chezmoi"
brew "cloud-sql-proxy"
brew "coreutils"
brew "direnv"
brew "dive"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "openjdk"
brew "flyway"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "go-task"
brew "gradle"
brew "grex"
brew "gzip"
brew "helix"
brew "httpie"
brew "jadx"
brew "jp2a"
brew "jq"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "maven"
brew "mcfly"
brew "miller"
brew "minikube"
brew "mise"
brew "moar"
brew "most"
brew "neofetch"
brew "tree-sitter", link: false
brew "neovim"
brew "nim"
brew "nushell"
brew "nvm"
brew "pgformatter"
brew "postgresql@14"
brew "procs"
brew "protobuf"
brew "protoc-gen-go"
brew "ripgrep"
brew "rust"
brew "sd"
brew "shfmt"
brew "skaffold"
brew "starship"
brew "step"
brew "stern"
brew "tealdeer"
brew "tmux"
brew "topgrade"
brew "trivy"
brew "unzip"
brew "watch"
brew "wget"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "auth0/auth0-cli/auth0"
brew "figuretechnologies/figure/json-log-parse"
brew "goreleaser/tap/goreleaser"
brew "jakewharton/repo/dependency-tree-diff"
brew "tufin/tufin/oasdiff"
brew "txn2/tap/kubefwd"
brew "warrensbox/tap/tfswitch"
brew "withgraphite/tap/graphite"
cask "1password"
cask "1password-cli"
cask "android-commandlinetools"
cask "appcleaner"
cask "betterdisplay"
cask "cyberduck"
cask "dbeaver-community"
cask "docker"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "google-cloud-sdk"
cask "hiddenbar"
cask "httpie"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keycastr"
cask "kube-forwarder"
cask "librewolf", args: { no_quarantine: true }
cask "microsoft-edge"
cask "notion"
cask "openvpn-connect"
cask "orbstack"
cask "poe"
cask "postman"
cask "raycast"
cask "rectangle"
cask "rocket"
cask "slack"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "visualvm"
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
vscode "arcticicestudio.nord-visual-studio-code"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "k--kato.intellij-idea-keybindings"
vscode "ryu1kn.partial-diff"
vscode "sumneko.lua"
vscode "timonwong.shellcheck"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "zxh404.vscode-proto3"
