# Taps
tap "bufbuild/buf"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "tcrawford-figure/tools"
tap "tnk-studio/tools"
tap "txn2/tap"

# Essentials
brew "bash"
brew "bat"
brew "cask"
brew "chezmoi"
brew "exa"
brew "fd"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "gradle"
brew "gzip"
brew "httpie"
brew "jadx"
brew "jq"
brew "k9s"
brew "kotlin"
brew "ktlint"
brew "kubectx"
brew "neovim"
brew "node"
brew "nvm"
brew "postgresql"
brew "procs"
brew "protobuf"
brew "ripgrep"
brew "starship"
brew "stern"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "tree-sitter"
brew "txn2/tap/kubefwd"
brew "unzip"
brew "wget"
brew "yarn"
brew "yq"

# Experimental (to me)
brew "bottom"
brew "bufbuild/buf/buf"
brew "colima"
brew "delta"
brew "direnv"
brew "dust"
brew "helix-editor/helix/helix"
brew "miller"

# Fun
brew "neofetch"

# Questionable Needs
brew "coreutils"

# Casks
cask "1password-cli"
cask "alfred"
cask "appcleaner"
cask "brave-browser"
cask "dbeaver-community"
cask "docker"
cask "dozer"
cask "figma"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "iterm2"
cask "keepingyouawake"
cask "keycastr"
cask "kube-forwarder"
cask "loom"
cask "rectangle"
cask "spotify"
cask "wezterm"
